#include"list.h"

//目录
void menu()
{
	printf("*****************************\n");
	printf("*********1.生成链表**********\n");
	printf("*********2.销毁链表**********\n");
	printf("*********3.插入数据**********\n");
	printf("*********4.删除数据**********\n");
	printf("*********5.查找数据**********\n");
	printf("*********6.遍历链表**********\n");
	printf("*********7.反转链表**********\n");
	printf("*********8.中间节点**********\n");
	printf("*********9.奇偶调换**********\n");
	printf("*******10.判断是否成环*******\n");
	printf("*******11.反转链表(递归)*****\n");
	printf("*********0.退出程序**********\n");
	printf("*****************************\n");
}