#include"head.h"

void menu()
{
	printf("****************************\n");
	printf("******1.初始化队列**********\n");
	printf("******2.判断队列是否为空****\n");
	printf("******3.销毁队列************\n");
	printf("******4.清空队列************\n");
	printf("******5.获取头节点**********\n");
	printf("******6.入队****************\n");
	printf("******7.出队****************\n");
	printf("******8.获取队列长度********\n");
	printf("******9.遍历****************\n");
	printf("******0.退出程序************\n");

	printf("****************************\n");
}